In [1]:
# Loc and iloc

In [2]:
import numpy as np
import pandas as pd

In [3]:
# df.loc[index name, column name]
# df.iloc[index number, column number]

# loc and iloc : location and index location

In [4]:
a = [1,2,3,4,5]

In [7]:
dictionary = {
    'a' : 10, 
    'b' : 20
}

In [8]:
dictionary['a']

10

In [9]:
data = {
    'name' : ["Rahul", "Sakshi", "Amit", "Dhruv", "Dhruvi"],
    "roles" : ["IT", "IT", "HR", "finance", "HR"],
    "salary" : [100, 200, 150, 120, 400]
}

In [12]:
df = pd.DataFrame(data, index=list('abcde'))

In [13]:
df

     name    roles  salary
a   Rahul       IT     100
b  Sakshi       IT     200
c    Amit       HR     150
d   Dhruv  finance     120
e  Dhruvi       HR     400

In [15]:
df.loc['b'] # it will give me all the details about b index

name      Sakshi
roles         IT
salary       200
Name: b, dtype: object

In [24]:
df.loc['a' : 'c']['salary'] # ending point is inclusive

a    100
b    200
c    150
Name: salary, dtype: int64

In [25]:
df.loc['a', 'salary']

np.int64(100)

In [28]:
df.loc['c', 'roles']

'HR'

### df.loc : you can access any data from column or index name directly

In [29]:
df.iloc[0]

name      Rahul
roles        IT
salary      100
Name: a, dtype: object

In [30]:
df

     name    roles  salary
a   Rahul       IT     100
b  Sakshi       IT     200
c    Amit       HR     150
d   Dhruv  finance     120
e  Dhruvi       HR     400

In [33]:
df.loc['c']

name      Amit
roles       HR
salary     150
Name: c, dtype: object

In [41]:
df.iloc[1, 0:2] # 2 is my starting point, and 4 is ending point, where ending point is non-inclusive

name     Sakshi
roles        IT
Name: b, dtype: object

In [42]:
# : -> all rows
# 0 : 2 :

In [43]:
df.loc['a' : 'c']

     name roles  salary
a   Rahul    IT     100
b  Sakshi    IT     200
c    Amit    HR     150

In [44]:
df.iloc[0:2]

     name roles  salary
a   Rahul    IT     100
b  Sakshi    IT     200

In [45]:
df.loc['a', 'name'] = "Harsh"

In [46]:
df

     name    roles  salary
a   Harsh       IT     100
b  Sakshi       IT     200
c    Amit       HR     150
d   Dhruv  finance     120
e  Dhruvi       HR     400

In [47]:
df.iloc[0, 0] = "Kishan"

In [48]:
df

     name    roles  salary
a  Kishan       IT     100
b  Sakshi       IT     200
c    Amit       HR     150
d   Dhruv  finance     120
e  Dhruvi       HR     400

### df.loc : 
##### you will have access to the direct names of index and column! and when working with ranges, end point will be inclusive

### df.iloc : 
##### you will have access to the rows and columns by their indeces (you have to write index number - similar to access data in list or numpy]) , when working with ranges, end point will be non-inclusive!